<template>
	<div class="layer-box ub ub-ac ub-pc">
		<div class="user-agreement">
			<div class="box-title">TPI用户服务协议</div>
			<div class="box-content">
				<p class="b-c-title">TPI用户服务协议</p>
				<p>请务必认真阅读和理解本《用户服务协议》（以下简称《协议》）中规定的所有权利和限制。除非您接受本《协议》条款，否则您无权注册、登录或使用本协议所涉及的相关服务。您一旦注册、登录、使用或以任何方式使用本《协议》所涉及的相关服务将视为对 本《协议》的接受，即表示您同意接受本《协议》各项条款的约束。如果您不同意本《协议》中的条款，请不要注册、登录或使用本《协议》相关服务。 本《协议》是用户与TPI market place公司（下称“TPI”）之间的法律协议。</p>
				<p class="b-c-title">第1条  服务内容 </p>
				<p><b>1.1您无需用户账户即可浏览本网站。</b>但某些网站功能和服务需要您注册TPI帐户，并且于注册页面上提供相关的个人信息。您可以按照网站说明随时终止使用您的账户，本网站将会依据本协议规定保留或终止您的账户。用户须对注册信息的真实性、合法性、有效性承担全部责任；用户不得冒充他人，不得利用他人的名义发布任何信息；不得恶意使用注册帐户导致其他用户误认；否则我们有权立即停止提供服务，您独自承担由此而产生的一切法律责任。
您使用本网站的行为必须合法，您必须为自己注册帐户下的一切行为负责，包括您所发表的任何内容以及由此产生的任何结果。用户应对其中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。TPI公司无法且不会对因用户行为而导致的任何损失或损害承担责任。
您对您的登录信息保密、不被其他人获取并使用且对您在本网站账户下的所有行为负责。您必须将任何有可能触犯法律的，未授权使用或怀疑为未授权使用的行为在第一时间通知本网站，本网站不对您因未能遵守上述要求而造成的损失承担责任。</p>
				<p><b>1.2您必须知悉并确认：</b>我们因业务发展需要，单方面对本服务的全部或部分服务内容在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销我们服务的权利，用户需承担此风险。
我们提供的服务中可能包括广告等活动，用户同意在使用过程中显示我们及关联方与第三方供应商、合作伙伴提供的广告以及其他活动。
我们有权自行全权决定以任何理由，对违反有关法律法规或本协议约定；或侵犯、妨害、威胁任何人权利或安全的内容，或者假冒他人的行为，有权依法停止传输任何相关内容，并有权依其自行判断对违反本协议的任何人士采取适当的法律行动，包括但不限于，从服务中删除具有违法性、侵权性、不当性等内容，终止违反者的成员资格，阻止其使用我们全部或部分服务，并且依据法律法规保存有关信息并向有关部门报告等。</p>
				<p class="b-c-title">第2条  用户使用规则</p>
				<p>2.1 用户在申请使用TPI网站网络服务时，必须向TPI提供准确的个人资料，如个人资料有任何变动，必须及时更新。因用户提供个人资料不准确、不真实而引发的一切后果由用户承担。</p>
				<p>2.2 用户不应将其帐号、密码转让、出借、销售或以任何脱离用户控制的形式交由他人使用。如用户发现其帐号遭他人非法使用，应立即通知TPI。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，TPI不承担任何责任。</p>
				<p>2.3 TPI帐号的所有权归TPI，用户完成注册申请手续后，获得TPI帐号的使用权。</p>
				<p>2.4 用户应当为自身注册帐户下的一切行为负责，因用户行为而导致的用户自身或其他任何第三方的任何损失或损害，TPI不承担责任。</p>
				<p>2.5 用户理解并接受TPI提供的服务中可能包括广告，同意在使用网络服务的过程中显示TPI和第三方供应商、合作伙伴提供的广告。</p>
				<p><b>2.6  用户在使用TPI网络服务过程中，必须遵循以下原则：</b></p>
				<p>2.6.1 遵守中国和泰国有关的法律和法规；</p>
				<p>2.6.2 遵守所有与网络服务有关的网络协议、规定和程序；</p>
				<p>2.6.3 不得为任何非法目的而使用网络服务系统；</p>
				<p>2.6.4 不得利用TPI网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；</p>
				<p>2.7.5 不得侵犯TPI和其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；</p>
				<p>2.6.6 不得利用TPI网络服务系统进行任何不利于TPI的行为；</p>
				<p>2.6.7 如发现任何非法使用用户账户或账户出现安全漏洞的情况，应立即通告TPI。</p>
				<p>2.8 如用户在使用网络服务时违反任何上述规定，TPI或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户收藏的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。</p>
				<p class="b-c-title">第3条  用户信息</p>
				<p>3.1用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且TPI保留终止用户使用TPI各项服务的权利。</p>
				<p>3.2用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</p>
				<p>3.3用户注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。</p>
				<p>3.4用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
				<p class="b-c-title">第4条  知识产权</p>
				<p>4.1 TPI 提供的网络服务中包含的任何文本、图片、图形、资料均受版权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得用于任何商业目的。</p>
				<p>4.2 TPI 为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图像、照片、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。</p>
				<p class="b-c-title">第5条  隐私保护</p>
				<p>5.1 保护用户隐私是TPI的一项基本政策，TPI保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在TPI的非公开内容，但下列情况除外：</p>
				<p>5.1.1 事先获得用户的明确授权；</p>
				<p>5.1.2 根据有关的法律法规要求；</p>
				<p>5.1.3 按照相关政府主管部门的要求；</p>
				<p>5.1.4 为维护社会公众的利益；</p>
				<p>5.1.5 为维护TPI的合法权益。</p>
				<p>5.2 在不透露单个用户隐私资料的前提下，TPI有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
				<p class="b-c-title">第6条 配送</p>
				<p>6.1销售方将会把商品（货物）送到您所指定的收货地址，所有在本站上列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。</p>
				<p>6.2因如下情况造成订单延迟或无法配送等，销售方不承担延迟配送的责任：</p>
				<p>（1）用户提供的信息错误、地址不详细等原因导致的；</p>
				<p>（2）货物送达后无人签收，导致无法配送或延迟配送的；</p>
				<p>（3）情势变更因素导致的；</p>
				<p>（4）不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等</p>
				<p class="b-c-title">第7条 免责声明</p>
				<p>7.1 TPI不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</p>
				<p>7.2 TPI 不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由TPI实际控制的任何网页上的内容，TPI不承担任何责任。</p>
				<p>7.3 对于因互联网网络故障、计算机故障或病毒、信息损坏或丢失、计算机系统问题或其它任何不可抗力原因而产生损失，TPI不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
				<p class="b-c-title">第8条  法律及争议解决</p>
				<p>本协议适用中华人民共和国法律。</p>
				<p class="b-c-title">第9条  其他</p>
				<p>9.1 TPI尊重用户和消费者的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本站欢迎用户和社会各界提出意见和建议，TPI将虚心接受并适时修改本协议及本站上的各类规则。</p>
				<p>9.2本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</p>
				<p>9.3您点击本协议下方的;同意并继续;按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>
			</div>
			<div class="agreed bc-do-btn">同意并继续</div>
		</div>
	</div>
</template>

<script>
</script>

<style lang="scss" scoped>
.user-agreement{
	width: 808px;
	height: 618px;
	background: #fff;
	font-size: 14px;
	color:#222;
	.box-title{
		height: 36px;
		line-height: 36px;
		background-color: #f5f3f2;
		padding: 0 10px;
		margin: 4px 4px 0;
		font-weight: bold;
	}
	.box-content{
		margin:12px 16px 20px 24px;
		padding-right: 10px;
		max-height: 448px;
		overflow-y: auto;
		.b-c-title{
			margin-top: 3px;
			height: 28px;
			line-height: 28px;
		}
		p:not(.b-c-title){
			font-size: 12px;
			color:#555;
			line-height: 20px;
		}
	}
	.agreed{
		width: 262px;
		height: 60px;
		margin: 11px auto 0;
		font-size:18px;
		line-height: 60px;
		color:#fff;
		text-align: center;
	}
}
	
</style>